Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: "当！当当将以75亿元卖身天海投资",
    author: "守一",
    date: "2018-4-11 20:55:28",
    resource: "IT之家",
    essay: "\t 早在3月份的时候，当当网要“卖身”的消息就有了，而接盘方将会是海航系旗下的天海投资。今天晚上，天海投资披露重组预案，拟作价75亿元收购当当网，增值率约235倍，并拟配套募资不超40.6亿元。据了解，天津天海投资发展股份有限公司拟通过发行股份及支付现金方式，购买北京当当网信息技术有限公司股权及北京当当科文电子商务有限公司100%股权并募集配套资金。\n" +
    "\t 当当科文股权由俞渝、李国庆、天津骞程、天津微量、上海宜修100%持有，北京当当则由天津科文、天津国略、天津骞程、天津微量、上海宜修、E-Commerce 100%持有。\n" +
    "\t 当当网也通过微博发布消息称，当当与天海投资已经于今天签约，文件已经提交并等待相关部门审核。",
    img:"../../img/news/newdandan.jpg",
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})